convertigo-templates/lib_Salesforce/soap-templates/SoapBinding/CresetPassword.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:partner.soap.sforce.com">
   <soapenv:Header>
      <urn:EmailHeader>
         <!--type: {http://www.w3.org/2001/XMLSchema}boolean-->
         <urn:triggerAutoResponseEmail>$(HEADER_EMAILHEADER_TRIGGERAUTORESPONSEEMAIL)</urn:triggerAutoResponseEmail>
         <!--type: {http://www.w3.org/2001/XMLSchema}boolean-->
         <urn:triggerOtherEmail>$(HEADER_EMAILHEADER_TRIGGEROTHEREMAIL)</urn:triggerOtherEmail>
         <!--type: {http://www.w3.org/2001/XMLSchema}boolean-->
         <urn:triggerUserEmail>$(HEADER_EMAILHEADER_TRIGGERUSEREMAIL)</urn:triggerUserEmail>
      </urn:EmailHeader>
      <urn:CallOptions>
         <!--type: {http://www.w3.org/2001/XMLSchema}string-->
         <urn:client>$(HEADER_CALLOPTIONS_CLIENT)</urn:client>
         <!--type: {http://www.w3.org/2001/XMLSchema}string-->
         <urn:defaultNamespace>$(HEADER_CALLOPTIONS_DEFAULTNAMESPACE)</urn:defaultNamespace>
      </urn:CallOptions>
      <urn:SessionHeader>
         <!--type: {http://www.w3.org/2001/XMLSchema}string-->
         <urn:sessionId>$(HEADER_SESSIONHEADER_SESSIONID)</urn:sessionId>
      </urn:SessionHeader>
   </soapenv:Header>
   <soapenv:Body>
      <urn:resetPassword>
         <!--type: {urn:partner.soap.sforce.com}ID-->
         <urn:userId>$(BODY_RESETPASSWORD_USERID)</urn:userId>
      </urn:resetPassword>
   </soapenv:Body>
</soapenv:Envelope>